org/work_clean.org
:PROPERTIES:
:ID:       9f8b4294-0cd3-48dc-be00-a2f3a6d02ac5
:END:
#+title: Work Clean

- title :: Work Clean
- author :: Dan Charnas
- tags :: [[id:563dcf37-472a-4203-b037-5a1635084ae9][Productivity]]

* Preparation
1. Always turn up early, greet the day
2. Calculate Meeze point
   - Optimal number of Actions done per day

* Process
1. Optimize the workplace:
   - Put pens etc near dominant hand, not so important things within
     arms reach. This is to prevent hands from crossing over, reducing friction.
   - Think about all the pain points, and think about how to automate
     them.
   - Make checklists for recurring tasks. Checklists are immutable,
     unlike task lists.
2. Difference between immersive time and process time
   - The first minutes matter more than the last
   - process time sometimes has more value
   - Assign a block of 30min in the morning for process time, then
     alternate between immersive and process time
3. Clean as you go
   - Remove distractions from workplace
   - Close emails etc as you go
   - Email mark and sweep process:
     1. Look through once, flagging and marking all as read
     2. Revisit flagged ones, take action if any
     3. Unflag when done
4. Slow down to move faster
   - Deliberately slow down to access quality velocity
   - Maintain some forward momentum
5. Aim to finish/keep the finish in mind
   - Do effort estimates, and try to keep tasks small, so that they're
     completable in shorter bursts
   - Clock in time, take deliberate breaks in between, weigh the value
     of a pause in between work
